In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [9]:
df = pd.DataFrame({'Sexo':['H', 'M', 'M', 'M', 'M', 'H', 'H', 'H', 'M', 'M'],'Idade':[53, 72, 54, 27, 30, 40, 54, 32, 44, 51]})
df

  Sexo  Idade
0    H     53
1    M     72
2    M     54
3    M     27
4    M     30
5    H     40
6    H     54
7    H     32
8    M     44
9    M     51

In [10]:
df.Idade.mean()

45.7

In [11]:
df.groupby('Sexo').mean()

          Idade
Sexo
H     44.750000
M     46.333333

In [12]:
df.Idade.median()

47.5

In [13]:
df.groupby('Sexo').median()

      Idade
Sexo
H      46.5
M      47.5

In [14]:
df.Idade.mode()

0    54
dtype: int64

In [15]:
dados = pd.read_csv('dados/dados.csv')
dados.head()

   UF  Sexo  Idade  Cor  Anos de Estudo  Renda    Altura
0  11     0     23    8              12    800  1.603808
1  11     1     23    2              12   1150  1.739790
2  11     1     35    8              15    880  1.760444
3  11     0     46    2               6   3500  1.783158
4  11     1     47    8               9    150  1.690631

## Assimetria a direita

In [28]:
moda = dados.Renda.mode()

In [29]:
media = dados.Renda.mean()

In [30]:
mediana = dados.Renda.median()

In [42]:
moda < mediana 
mediana < media

True

## Assimetria a esquerda

In [44]:
moda = dados['Anos de Estudo'].mode()
media = dados['Anos de Estudo'].mean()
mediana = dados['Anos de Estudo'].median()

In [45]:
moda > mediana
mediana > media

True